[
  {
    "id": "1",
    "slug": "premium-wireless-headphones",
    "name": "Premium Wireless Headphones",
    "description": "Experience unparalleled audio excellence with our state-of-the-art premium wireless headphones, meticulously engineered for audiophiles, music producers, and professionals who demand exceptional sound quality. Featuring industry-leading hybrid active noise cancellation technology with multiple microphones, these headphones create an immersive sonic environment by effectively eliminating up to 95% of ambient noise across a wide frequency spectrum. The ergonomic design incorporates memory foam-infused protein leather ear cushions that conform perfectly to your ear shape, ensuring exceptional comfort during extended listening sessions. With an extraordinary 30-hour battery life on a single charge with ANC enabled (up to 40 hours without), quick charging capability (15 minutes for 5 hours of playback), and multi-device Bluetooth 5.3 connectivity, these headphones represent the pinnacle of wireless audio technology. The integrated voice assistant support, customizable sound profiles via companion app, and environmental awareness mode make these the most versatile headphones on the market for critical listening, professional monitoring, travel, and daily commuting.",
    "price": 199.99,
    "originalPrice": 249.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 5,
    "reviewCount": 124,
    "isNew": true,
    "isSale": true,
    "tags": ["Wireless", "Noise Cancelling", "Bluetooth", "Premium Audio", "ANC"],
    "specification": "<ul><li><strong>Connectivity:</strong> Bluetooth 5.3 with multipoint pairing (connect to 2 devices simultaneously), 3.5mm audio jack with analog pass-through</li><li><strong>Battery Life:</strong> Up to 30 hours playback with ANC enabled, 40 hours without ANC</li><li><strong>Charging Time:</strong> 2 hours for full charge via USB-C, 15-minute quick charge provides 5 hours playback</li><li><strong>Noise Cancellation:</strong> Hybrid Active Noise Cancelling (ANC) with 4 microphones, adaptive noise cancellation, transparency mode</li><li><strong>Driver Technology:</strong> Custom-designed 40mm dynamic drivers with neodymium magnets and titanium-coated diaphragms</li><li><strong>Frequency Response:</strong> 4Hz-40kHz extended range for exceptional detail retrieval</li><li><strong>Impedance:</strong> 32 ohms</li><li><strong>Sensitivity:</strong> 103±3dB</li><li><strong>Codec Support:</strong> LDAC, AAC, SBC, aptX Adaptive for high-resolution audio streaming</li><li><strong>Weight:</strong> 250g (8.8 oz) without carrying case</li><li><strong>Microphone System:</strong> 6-mic array with beamforming technology and advanced noise reduction algorithm</li><li><strong>Controls:</strong> Touch-sensitive gesture controls, physical buttons for power/ANC, voice assistant activation</li><li><strong>Companion App:</strong> Custom EQ settings, firmware updates, ANC customization, find my headphones feature</li><li><strong>Materials:</strong> Premium matte finish plastics, stainless steel reinforcements, protein leather headband and ear cushions</li><li><strong>Included Accessories:</strong> Hard-shell carrying case, USB-C to USB-A charging cable, 3.5mm audio cable, airline adapter</li><li><strong>Warranty:</strong> 2 years manufacturer warranty with optional extended coverage</li></ul>"
  },
  {
    "id": "2",
    "slug": "minimalist-watch",
    "name": "Minimalist Watch",
    "description": "Exemplifying understated elegance and precision craftsmanship, this minimalist timepiece represents the perfect synthesis of form and function. Meticulously designed with a focus on clean lines and exceptional readability, the watch features a sophisticated sunray blue dial protected by scratch-resistant sapphire crystal with anti-reflective coating on both sides. The genuine Italian leather strap, hand-stitched by master craftsmen, develops a unique patina over time while ensuring exceptional comfort on the wrist. Powered by a highly accurate Japanese quartz movement renowned for its reliability, this watch maintains precision within ±20 seconds per month. The stainless steel 316L case provides superior corrosion resistance and durability, while the exhibition caseback offers a glimpse into the meticulously finished movement. Water resistant to 5 ATM (50 meters), this timepiece is suitable for everyday wear, light swimming, and showering. The luminous hands and markers ensure readability in low-light conditions, making this watch both a practical daily companion and a sophisticated accessory for formal occasions.",
    "price": 159.99,
    "imageUrl": ["/Product2.jpg", "/product1.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Accessories",
    "rating": 4,
    "reviewCount": 89,
    "isNew": false,
    "isSale": false,
    "tags": ["Leather", "Analog", "Water Resistant", "Minimalist", "Luxury"],
    "specification": "<ul><li><strong>Movement:</strong> Japanese Miyota quartz movement with end-of-life battery indicator</li><li><strong>Accuracy:</strong> ±20 seconds per month</li><li><strong>Case Material:</strong> Surgical-grade 316L stainless steel with brushed and polished finishes</li><li><strong>Case Diameter:</strong> 40mm with 48mm lug-to-lug distance</li><li><strong>Case Thickness:</strong> 8.5mm including domed crystal</li><li><strong>Lug Width:</strong> 20mm standard strap size</li><li><strong>Glass:</strong> Double-domed sapphire crystal with interior anti-reflective coating</li><li><strong>Water Resistance:</strong> 5 ATM (50 meters/165 feet) suitable for swimming and showering</li><li><strong>Strap:</strong> Genuine Italian calfskin leather with quick-release spring bars for easy changing</li><li><strong>Dial Color:</strong> Sunray blue finish with applied silver indices and subtle date window at 3 o'clock</li><li><strong>Hands:</strong> Diamond-cut silver hands with Super-LumiNova BGW9 fill for low-light visibility</li><li><strong>Features:</strong> Date display at 3 o'clock, luminous markers, exhibition caseback</li><li><strong>Battery Life:</strong> 3 years estimated lifespan (CR2016 battery)</li><li><strong>Crown:</strong> Screw-down crown with custom embossed logo</li><li><strong>Weight:</strong> 65g without strap, 105g with leather strap</li><li><strong>Packaging:</strong> Premium presentation box with warranty card and instruction manual</li><li><strong>Warranty:</strong> 2 years international warranty covering manufacturing defects</li></ul>"
  },
  {
    "id": "3",
    "slug": "organic-cotton-tshirt",
    "name": "Organic Cotton T-Shirt",
    "description": "Crafted with meticulous attention to sustainability and comfort, this premium organic cotton t-shirt represents the future of responsible fashion. Made from 100% GOTS certified organic cotton sourced from ethical farms that prioritize soil health, water conservation, and fair labor practices. The mid-weight 180 GSM fabric provides exceptional durability while maintaining a soft hand feel that becomes even more comfortable with each wash. The regular fit silhouette is carefully designed with slightly longer sleeves and body length for modern proportions that drape elegantly without being oversized. Reinforced shoulder seams and double-stitched hemming ensure long-lasting wear, while the ribbed collar maintains its shape wash after wash. The garment is produced in a Fair Trade certified facility that provides living wages, safe working conditions, and community development programs. With excellent color retention due to advanced dyeing techniques using low-impact, eco-friendly dyes, this t-shirt offers both timeless style and peace of mind for the environmentally conscious consumer who values quality, ethics, and comfort in equal measure.",
    "price": 29.99,
    "originalPrice": 39.99,
    "imageUrl": ["/380.jpg", "/Product1.jpg", "/product2.jpg", "/4094.jpg"],
    "category": "Clothing",
    "rating": 3,
    "reviewCount": 67,
    "isNew": false,
    "isSale": true,
    "tags": ["Organic", "Sustainable", "Comfort Fit", "Eco-Friendly", "Fair Trade"],
    "specification": "<ul><li><strong>Material:</strong> 100% GOTS certified organic long-staple cotton</li><li><strong>Certifications:</strong> Global Organic Textile Standard (GOTS), Fair Trade Certified, OEKO-TEX Standard 100</li><li><strong>Weight:</strong> 180 GSM (mid-weight) single jersey construction</li><li><strong>Fit:</strong> Regular fit with modern proportions - not too slim, not too loose</li><li><strong>Neckline:</strong> Reinforced crew neck with ribbed collar that maintains shape</li><li><strong>Sleeve:</strong> Short sleeve with extended length for contemporary look</li><li><strong>Seams:</strong> Double-needle stitched sleeves and bottom hem for durability</li><li><strong>Care Instructions:</strong> Machine wash cold with like colors, tumble dry low, avoid bleach, iron on medium heat if needed</li><li><strong>Shrinkage:</strong> Pre-shrunk fabric with less than 3% shrinkage after washing</li><li><strong>Color Fastness:</strong> Excellent color retention due to advanced dyeing technology with eco-friendly dyes</li><li><strong>Production:</strong> Fair Trade certified manufacturing facility with ethical labor practices</li><li><strong>Environmental Impact:</strong> 80% reduced water consumption compared to conventional cotton production</li><li><strong>Origin:</strong> Made in India with transparent supply chain tracking</li><li><strong>Sizes:</strong> XS to XXL with detailed size chart provided</li><li><strong>XS Measurements:</strong> Chest: 34\", Length: 26.5\"</li><li><strong>M Measurements:</strong> Chest: 40\", Length: 28.5\"</li><li><strong>XXL Measurements:</strong> Chest: 48\", Length: 30.5\"</li><li><strong>Packaging:</strong> 100% recycled and recyclable materials with soy-based ink printing</li></ul>"
  },
  {
    "id": "4",
    "slug": "leather-backpack",
    "name": "Leather Backpack",
    "description": "Expertly handcrafted by master artisans using traditional techniques, this full-grain leather backpack represents the perfect marriage of timeless aesthetics and modern functionality. Constructed from premium vegetable-tanned leather that develops a rich patina over time, each piece tells its own unique story through natural variations and character marks. The backpack features a thoughtfully designed interior with multiple organizational compartments, including a padded laptop sleeve that accommodates up to 15-inch devices, a dedicated tablet pocket, and various smaller pockets for accessories and documents. The exterior showcases meticulous saddle stitching using waxed polyester thread that becomes stronger with age, solid brass hardware that develops a beautiful natural oxidation, and reinforced stress points for enhanced durability. The adjustable padded shoulder straps distribute weight evenly across the shoulders, while the top carry handle provides alternative carrying options. The water-resistant base protects contents from moisture, and the leather pull tabs and key fob add convenient functionality. This backpack transitions seamlessly from professional environments to travel adventures to casual outings, offering unparalleled craftsmanship that improves with age and use.",
    "price": 129.99,
    "originalPrice": 179.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Accessories",
    "rating": 4.6,
    "reviewCount": 54,
    "isNew": true,
    "isSale": true,
    "tags": ["Leather", "Handmade", "Travel", "Professional", "Artisanal"],
    "specification": "<ul><li><strong>Material:</strong> Full-grain vegetable-tanned leather from environmentally responsible tanneries</li><li><strong>Leather Thickness:</strong> 1.8-2.0mm premium weight</li><li><strong>Dimensions:</strong> 12\" x 18\" x 6\" (30 x 45 x 15 cm)</li><li><strong>Capacity:</strong> 20 liters main compartment with expansion capability</li><li><strong>Compartments:</strong> Main compartment with dual zipper access, front organizational pocket with multiple slots, rear hidden security pocket</li><li><strong>Laptop Sleeve:</strong> Padded compartment fits up to 15-inch laptop with additional tablet sleeve</li><li><strong>Hardware:</strong> Solid brass YKK zippers, antique-finished buckles and D-rings</li><li><strong>Straps:</strong> Adjustable padded shoulder straps with breathable mesh backing, removable sternum strap</li><li><strong>Weight:</strong> 1.2 kg (2.6 lbs) empty</li><li><strong>Load Capacity:</strong> Recommended maximum load 8kg (17.6 lbs)</li><li><strong>Features:</strong> Leather pull tabs, detachable key fob with brass hardware, water-resistant base, internal pen holders</li><li><strong>Craftsmanship:</strong> Hand-stitched with saddle stitching technique using waxed polyester thread</li><li><strong>Edge Finishing:</strong> Burnished edges with natural wax finish</li><li><strong>Patina Development:</strong> Leather naturally darkens and develops character with use over time</li><li><strong>Care Instructions:</strong> Condition with natural leather conditioner every 6-12 months depending on use</li><li><strong>Production Time:</strong> Each backpack requires 8-10 hours of skilled craftsmanship</li><li><strong>Warranty:</strong> Lifetime craftsmanship warranty against manufacturing defects</li></ul>"
  },
  {
    "id": "5",
    "slug": "gaming-laptop-pro-15",
    "name": "Gaming Laptop Pro 15",
    "description": "Unleash the full power of next-gen gaming with the Gaming Laptop Pro 15, a beast of a machine built for uncompromising performance. Equipped with the latest Intel Core i7 processor and an NVIDIA GeForce RTX 4060 GPU, this laptop handles the most demanding AAA titles with ease. The stunning 15.6\" QHD (2560x1440) 165Hz IPS display delivers ultra-smooth visuals with vibrant colors and exceptional clarity, giving you a competitive edge. Advanced cooling technology with dual fans and five heat pipes ensures the system stays cool under pressure, preventing thermal throttling. The 1TB NVMe PCIe 4.0 SSD provides lightning-fast loading times, while 16GB of DDR5 RAM allows for seamless multitasking. A full-size per-key RGB backlit keyboard offers a satisfying typing experience and customizable lighting. With a large 80Wh battery, you can game on the go, and a comprehensive selection of ports including Thunderbolt 4, USB-C, and HDMI 2.1 provides all the connectivity you need. This laptop is a perfect blend of raw power and sleek design, ready to tackle any challenge, from high-stakes gaming to creative work and beyond.",
    "price": 1299.99,
    "originalPrice": 1499.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.9,
    "reviewCount": 310,
    "isNew": true,
    "isSale": true,
    "tags": ["Gaming", "RTX", "Performance", "Laptop", "High-End"],
    "specification": "<ul><li><strong>Processor:</strong> Intel Core i7-12700H (14 cores, 20 threads, up to 4.7 GHz)</li><li><strong>Graphics:</strong> NVIDIA GeForce RTX 4060 8GB GDDR6 with 105W TGP</li><li><strong>Memory:</strong> 16GB DDR5 4800MHz (up to 64GB upgradable)</li><li><strong>Storage:</strong> 1TB NVMe PCIe 4.0 SSD (with additional M.2 slot for expansion)</li><li><strong>Display:</strong> 15.6\" QHD (2560x1440) IPS, 165Hz refresh rate, 3ms response time, 100% DCI-P3 color gamut, G-Sync support</li><li><strong>Operating System:</strong> Windows 11 Home</li><li><strong>Battery:</strong> 80Wh 4-cell lithium-ion, up to 6 hours of mixed use</li><li><strong>Ports:</strong> 1x Thunderbolt 4 (USB-C), 2x USB 3.2 Gen 2 Type-A, 1x USB 3.2 Gen 2 Type-C, 1x HDMI 2.1, 1x Ethernet, 1x 3.5mm audio jack</li><li><strong>Connectivity:</strong> Intel Wi-Fi 6E AX210, Bluetooth 5.2</li><li><strong>Cooling:</strong> Vapor Chamber cooling with dual 83-blade fans and 5 heat pipes</li><li><strong>Keyboard:</strong> Per-key RGB backlit keyboard with anti-ghosting</li><li><strong>Audio:</strong> Stereo speakers with Nahimic 3D Audio</li><li><strong>Webcam:</strong> 720p HD webcam with privacy shutter</li><li><strong>Weight:</strong> 2.3 kg (5.1 lbs)</li><li><strong>Warranty:</strong> 1 year global warranty</li></ul>"
  },
  {
    "id": "6",
    "slug": "lightweight-running-shoes",
    "name": "Lightweight Running Shoes",
    "description": "Engineered for optimal performance and comfort, the Lightweight Running Shoes are your perfect partner for everyday training and long-distance runs. The seamless engineered mesh upper provides superior breathability, keeping your feet cool and dry, while strategically placed synthetic overlays offer structural support. The responsive EVA foam midsole delivers exceptional energy return and plush cushioning, absorbing impact and propelling you forward with every stride. The carbon rubber outsole features high-wear zones for enhanced durability and reliable traction on various road surfaces. With an 8mm heel-to-toe drop, this shoe promotes a natural foot strike and smooth transition. The traditional lace-up closure ensures a secure, personalized fit, and the padded collar and tongue provide additional comfort. Reflective elements are integrated for increased visibility during low-light conditions. These shoes are designed for neutral runners seeking a lightweight, comfortable, and durable option for their daily mileage.",
    "price": 89.99,
    "originalPrice": 119.99,
    "imageUrl": ["/Product2.jpg", "/product1.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Footwear",
    "rating": 4.4,
    "reviewCount": 202,
    "isNew": false,
    "isSale": true,
    "tags": ["Running", "Comfort", "Sport", "Lightweight", "Athletic"],
    "specification": "<ul><li><strong>Upper Material:</strong> Seamless engineered mesh with no-sew synthetic overlays</li><li><strong>Midsole:</strong> Full-length responsive EVA foam</li><li><strong>Outsole:</strong> Durable carbon rubber in high-wear areas</li><li><strong>Drop:</strong> 8mm heel-to-toe drop</li><li><strong>Weight:</strong> 255g (9 oz) per shoe for US size 9</li><li><strong>Closure:</strong> Traditional lace-up system with flat laces</li><li><strong>Fit:</strong> Regular width, true-to-size fit</li><li><strong>Support Type:</strong> Neutral, suitable for underpronators and neutral runners</li><li><strong>Surface:</strong> Road running</li><li><strong>Insole:</strong> Removable cushioned insole</li><li><strong>Features:</strong> Reflective details for visibility, breathable tongue and collar</li><li><strong>Sizes:</strong> US 7-13, including half sizes</li><li><strong>Colors:</strong> Black/White, Blue/Gray, Red/Black</li><li><strong>Arch Support:</strong> Medium arch support</li><li><strong>Warranty:</strong> 6-month limited warranty on manufacturing defects</li></ul>"
  },
  {
    "id": "7",
    "slug": "true-wireless-earbuds",
    "name": "True Wireless Earbuds",
    "description": "Experience superior audio freedom with our True Wireless Earbuds, a perfect blend of compact design, powerful sound, and intuitive features. These earbuds deliver crystal-clear audio with deep bass and crisp highs, thanks to 10mm dynamic drivers. The advanced Bluetooth 5.3 technology ensures a stable and seamless connection with multipoint pairing, allowing you to switch effortlessly between your phone and laptop. Enjoy an impressive 8 hours of playback on a single charge, with an additional 22 hours provided by the sleek charging case, totaling a remarkable 30 hours of battery life. The IPX5 water resistance rating makes them perfect for workouts and outdoor activities, protecting against sweat and light rain. Featuring hybrid active noise cancellation (ANC) and a transparency mode, you can either immerse yourself in your music or stay aware of your surroundings. A six-microphone array with Environmental Noise Cancellation (ENC) ensures your voice comes through loud and clear during calls. With touch controls for managing music and calls, and a dedicated low-latency gaming mode, these earbuds offer a truly versatile and high-performance audio experience.",
    "price": 79.99,
    "imageUrl": ["/380.jpg", "/Product1.jpg", "/product2.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.2,
    "reviewCount": 156,
    "isNew": true,
    "isSale": false,
    "tags": ["Wireless", "Bluetooth", "Compact", "ANC", "Water Resistant"],
    "specification": "<ul><li><strong>Connectivity:</strong> Bluetooth 5.3 with multipoint pairing</li><li><strong>Battery Life:</strong> Up to 8 hours (earbuds), 30 hours (with charging case)</li><li><strong>Charging:</strong> USB-C charging case, Qi wireless charging compatible</li><li><strong>Water Resistance:</strong> IPX5 (sweat and water resistant)</li><li><strong>Driver Size:</strong> 10mm dynamic drivers</li><li><strong>Microphone System:</strong> 6 mics with Environmental Noise Cancellation (ENC) for crystal-clear calls</li><li><strong>Noise Control:</strong> Hybrid Active Noise Cancellation, Transparency Mode</li><li><strong>Controls:</strong> Customizable touch controls (play/pause, skip, volume, call management)</li><li><strong>Latency:</strong> Low-latency gaming mode (60ms)</li><li><strong>Compatibility:</strong> Universal compatibility with iOS and Android devices</li><li><strong>Ear Tips:</strong> Comes with 3 sizes of silicone ear tips (S, M, L)</li><li><strong>Weight:</strong> 4.5g per earbud</li><li><strong>Dimensions:</strong> Earbuds: 25mm x 20mm x 22mm, Case: 60mm x 45mm x 28mm</li><li><strong>Warranty:</strong> 1 year manufacturer warranty</li></ul>"
  },
  {
    "id": "8",
    "slug": "ceramic-mug-set-4-pcs",
    "name": "Ceramic Mug Set (4 pcs)",
    "description": "Elevate your daily coffee or tea ritual with our elegant Ceramic Mug Set. This set of four mugs is crafted from high-quality, durable ceramic with a sophisticated matte exterior and a glossy interior finish, offering a beautiful contrast and easy cleaning. Each mug has a generous 12 oz (350 ml) capacity, making it perfect for your morning brew, a comforting hot chocolate, or an afternoon tea. The minimalist design with clean lines and an ergonomically designed handle provides a comfortable and secure grip. These mugs are both microwave and dishwasher safe, offering maximum convenience for everyday use. The sturdy construction ensures they are resistant to chipping and cracking. Packaged in a beautiful gift box with dividers to prevent breakage, this set makes an ideal present for housewarmings, weddings, or any special occasion. A timeless addition to any kitchen, the Ceramic Mug Set combines aesthetic appeal with practical functionality.",
    "price": 34.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Home & Kitchen",
    "rating": 4.7,
    "reviewCount": 82,
    "isNew": false,
    "isSale": false,
    "tags": ["Ceramic", "Kitchen", "Drinkware", "Home Decor", "Gift"],
    "specification": "<ul><li><strong>Material:</strong> High-quality, lead-free ceramic with a matte exterior glaze and glossy interior</li><li><strong>Capacity:</strong> 12 oz (350 ml) each</li><li><strong>Dimensions:</strong> 3.75\" height x 3.25\" diameter</li><li><strong>Weight:</strong> Approximately 380g per mug</li><li><strong>Finish:</strong> Matte exterior with a smooth, glossy interior</li><li><strong>Microwave Safe:</strong> Yes</li><li><strong>Dishwasher Safe:</strong> Yes, top rack recommended for longevity</li><li><strong>Oven Safe:</strong> No</li><li><strong>Handle:</strong> Ergonomically designed for comfortable grip</li><li><strong>Design:</strong> Minimalist, modern design</li><li><strong>Packaging:</strong> Set of 4 mugs in a protected gift box with dividers</li><li><strong>Colors:</strong> Available in Slate Gray, Matte Black, Cream, and Sage Green</li><li><strong>Durability:</strong> Chip and crack resistant</li></ul>"
  },
  {
    "id": "9",
    "slug": "shockproof-smartphone-case",
    "name": "Shockproof Smartphone Case",
    "description": "Protect your valuable device with our Shockproof Smartphone Case, engineered to provide military-grade drop protection without adding unnecessary bulk. The case features a rigid polycarbonate back that resists scratches and impacts, combined with a flexible TPU bumper that absorbs shock from drops. Raised bezels of 1.5mm around the screen and camera lens provide crucial protection against scratches and cracks when the phone is placed on flat surfaces. Precision cutouts ensure easy access to all ports, buttons, and speakers, while the tactile button covers provide a satisfying click and response. Despite its robust protection, the case is slim and lightweight, maintaining the sleek profile of your phone. It is also fully compatible with wireless charging, so you don't have to remove the case to power up your device. The textured sides of the TPU bumper enhance grip, preventing accidental slips. Available in a range of colors, this case offers a perfect balance of style, durability, and functionality, giving you peace of mind wherever you go.",
    "price": 19.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Accessories",
    "rating": 4.5,
    "reviewCount": 290,
    "isNew": true,
    "isSale": false,
    "tags": ["Case", "Shockproof", "Durable", "Protection", "Phone Accessory"],
    "specification": "<ul><li><strong>Compatibility:</strong> Designed for the latest iPhone series (e.g., iPhone 15, iPhone 15 Pro)</li><li><strong>Material:</strong> Dual-layer construction with a hard polycarbonate back and a soft TPU bumper</li><li><strong>Protection:</strong> Certified military-grade drop protection (MIL-STD-810G)</li><li><strong>Raised Bezels:</strong> 1.5mm raised lip around the screen and camera for enhanced protection</li><li><strong>Features:</strong> Precise cutouts, responsive button covers, wireless charging compatible</li><li><strong>Grip:</strong> Textured sides for a secure, non-slip grip</li><li><strong>Color Options:</strong> Matte Black, Navy Blue, Clear, Translucent Purple</li><li><strong>Weight:</strong> 28g (0.98 oz)</li><li><strong>Installation:</strong> Easy snap-on design</li><li><strong>Warranty:</strong> 1-year limited warranty against manufacturing defects</li></ul>"
  },
  {
    "id": "10",
    "slug": "wireless-keyboard-mouse-combo",
    "name": "Wireless Keyboard & Mouse Combo",
    "description": "Simplify your workspace with the Wireless Keyboard & Mouse Combo, a sleek and efficient solution for your computing needs. This full-size keyboard features low-profile scissor-switch keys that provide a quiet and comfortable typing experience, ideal for both office work and home use. The included ergonomic mouse offers smooth and precise control with 1600 DPI optical tracking. Both devices connect effortlessly via a single 2.4GHz USB nano receiver, ensuring a reliable and lag-free connection up to 10 meters away. With an impressive battery life—up to 36 months for the keyboard and 12 months for the mouse on a single set of batteries—you can work for long periods without interruption. The durable ABS plastic construction with a matte finish provides a professional look and feel. This combo is compatible with a wide range of operating systems, making it a versatile and reliable choice for your desktop or laptop setup.",
    "price": 49.99,
    "originalPrice": 69.99,
    "imageUrl": ["/product2.jpg", "/Product1.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.3,
    "reviewCount": 178,
    "isNew": false,
    "isSale": true,
    "tags": ["Wireless", "Keyboard", "Mouse", "Ergonomic", "Office"],
    "specification": "<ul><li><strong>Connectivity:</strong> 2.4GHz wireless via a single USB nano receiver</li><li><strong>Battery Life:</strong> Keyboard: up to 36 months, Mouse: up to 12 months (battery type: 2x AAA for keyboard, 1x AA for mouse)</li><li><strong>Keyboard Layout:</strong> Full-size with a numeric keypad, 104 keys</li><li><strong>Keyboard Keys:</strong> Quiet, low-profile scissor-switch keys</li><li><strong>Mouse DPI:</strong> 1600 DPI optical tracking</li><li><strong>Compatibility:</strong> Windows 7/8/10/11, macOS, Chrome OS</li><li><strong>Range:</strong> Up to 10 meters (33 feet)</li><li><strong>Material:</strong> Durable ABS plastic with a matte finish</li><li><strong>Dimensions:</strong> Keyboard: 17.3 x 5.1 x 0.6 inches (44 x 13 x 1.5 cm), Mouse: 4.1 x 2.4 x 1.4 inches (10.5 x 6 x 3.5 cm)</li><li><strong>Weight:</strong> Keyboard: 580g, Mouse: 85g</li><li><strong>Features:</strong> Media shortcut keys, auto-sleep function</li><li><strong>Warranty:</strong> 1 year limited warranty</li></ul>"
  },
  {
    "id": "11",
    "slug": "fitness-smartwatch",
    "name": "Fitness Smartwatch",
    "description": "Take control of your health and fitness journey with the advanced Fitness Smartwatch. Featuring a vibrant 1.3\" AMOLED display, this smartwatch provides crystal-clear visuals of your stats, notifications, and watch faces. It is equipped with a comprehensive suite of health monitoring sensors, including a precise heart rate tracker, SpO2 sensor for blood oxygen saturation, and detailed sleep tracking. With over 100 dedicated workout modes and built-in GPS and GLONASS, it accurately records your runs, hikes, and other activities without needing your phone. The 5 ATM water resistance rating means you can wear it while swimming. Stay connected with call, message, and app notifications delivered right to your wrist. The watch also offers 4GB of storage for music, allowing you to listen to your favorite tunes without carrying your phone. With up to 7 days of battery life on a single charge and a comfortable, interchangeable silicone strap, this smartwatch is designed to keep up with your active lifestyle.",
    "price": 199.99,
    "originalPrice": 249.99,
    "imageUrl": ["/380.jpg", "/Product1.jpg", "/product2.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.6,
    "reviewCount": 215,
    "isNew": true,
    "isSale": true,
    "tags": ["Fitness", "Smartwatch", "Wearable", "Health", "GPS"],
    "specification": "<ul><li><strong>Display:</strong> 1.3\" AMOLED touchscreen with 416x416 pixel resolution</li><li><strong>Battery Life:</strong> Up to 7 days (typical use), 14 days (power-saving mode)</li><li><strong>Health Monitoring:</strong> 24/7 heart rate tracking, SpO2 (blood oxygen) monitoring, stress monitoring, sleep tracking</li><li><strong>Sports Modes:</strong> Over 100 sport modes including running, cycling, swimming, and more</li><li><strong>GPS:</strong> Built-in GPS + GLONASS for accurate route tracking</li><li><strong>Water Resistance:</strong> 5 ATM (50 meters)</li><li><strong>Connectivity:</strong> Bluetooth 5.0, compatible with iOS 10.0+ and Android 5.0+</li><li><strong>Notifications:</strong> Call, text, and app notifications, quick replies (Android only)</li><li><strong>Storage:</strong> 4GB internal storage for music playback</li><li><strong>Sensors:</strong> Optical heart rate sensor, accelerometer, gyroscope, SpO2 sensor</li><li><strong>Charging:</strong> Magnetic charging dock (full charge in approx. 1.5 hours)</li><li><strong>Strap:</strong> 20mm interchangeable silicone strap</li><li><strong>Weight:</strong> 35g (without strap)</li><li><strong>Warranty:</strong> 2-year limited warranty</li></ul>"
  },
  {
    "id": "12",
    "slug": "espresso-coffee-machine",
    "name": "Espresso Coffee Machine",
    "description": "Become your own barista with the Espresso Coffee Machine, designed to bring the coffee shop experience to your kitchen. This semi-automatic machine features a powerful 15-bar high-pressure pump that extracts maximum flavor and aroma from your coffee grounds, producing rich, creamy espresso with a perfect crema. The integrated professional stainless steel portafilter and tamper ensure a consistent, high-quality brew every time. An adjustable steam wand lets you easily froth milk to create lattes, cappuccinos, and macchiatos with cafe-quality foam. With a large 1.5-liter removable water tank, you can brew multiple cups without frequent refills. The machine's sleek stainless steel body is durable and easy to clean, and the compact footprint saves valuable counter space. From a robust morning espresso to a velvety cappuccino, this machine gives you full control over your brew, satisfying every coffee craving with a single touch.",
    "price": 349.99,
    "originalPrice": 399.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Home & Kitchen",
    "rating": 4.8,
    "reviewCount": 98,
    "isNew": true,
    "isSale": true,
    "tags": ["Coffee", "Espresso", "Kitchen", "Barista", "Appliance"],
    "specification": "<ul><li><strong>Type:</strong> Semi-automatic espresso machine</li><li><strong>Pump Pressure:</strong> 15 bar high-pressure pump</li><li><strong>Water Tank Capacity:</strong> 1.5 liters (50.7 oz) removable tank</li><li><strong>Portafilter:</strong> 54mm stainless steel portafilter</li><li><strong>Steam Wand:</strong> Adjustable stainless steel steam wand for frothing milk</li><li><strong>Features:</strong> Built-in pressure gauge, hot water dispenser for americanos or tea, removable drip tray</li><li><strong>Materials:</strong> Brushed stainless steel body and BPA-free parts</li><li><strong>Dimensions:</strong> 12 x 10 x 14 inches (30.5 x 25.4 x 35.6 cm)</li><li><strong>Power:</strong> 1200W, 120V</li><li><strong>Included Accessories:</strong> Stainless steel tamper, single and double shot filter baskets</li><li><strong>Warranty:</strong> 2 years limited manufacturer warranty</li></ul>"
  },
  {
    "id": "13",
    "slug": "wireless-gaming-mouse",
    "name": "Wireless Gaming Mouse",
    "description": "Gain a competitive edge with the Wireless Gaming Mouse, engineered for lightning-fast responsiveness and ultimate comfort. Weighing in at an ultra-light 63g, this mouse reduces wrist fatigue during long gaming sessions. It features the top-of-the-line Pixart 3395 optical sensor, providing incredibly accurate tracking with up to 26,000 DPI. The mouse offers versatile connectivity with a 2.4GHz wireless dongle for a lag-free experience and Bluetooth for general use. The six programmable buttons allow you to customize your gameplay, while the customizable RGB lighting adds a touch of personalized style to your setup. With a battery life of up to 70 hours with RGB off, you can game for days on end without needing to recharge. When the battery does run low, a quick charge via USB-C gets you back in the game in no time. The pure PTFE feet ensure a smooth glide across any surface, and its ergonomic shape fits perfectly in your hand for maximum control and comfort.",
    "price": 69.99,
    "originalPrice": 89.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.5,
    "reviewCount": 350,
    "isNew": true,
    "isSale": true,
    "tags": ["Gaming", "Wireless", "RGB", "Performance", "Esports"],
    "specification": "<ul><li><strong>Connectivity:</strong> 2.4GHz wireless (via dongle) and Bluetooth 5.1</li><li><strong>Sensor:</strong> Pixart 3395 optical sensor</li><li><strong>DPI:</strong> Adjustable from 100 to 26,000 DPI</li><li><strong>Polling Rate:</strong> 1000Hz (1ms response time)</li><li><strong>Buttons:</strong> 6 fully programmable buttons</li><li><strong>Weight:</strong> 63g (2.2 oz) ultra-lightweight design</li><li><strong>Battery Life:</strong> Up to 70 hours with RGB off, 50 hours with RGB on</li><li><strong>Charging:</strong> USB-C charging port, cable included</li><li><strong>Features:</strong> Customizable RGB lighting, onboard memory for profiles, PTFE glide feet</li><li><strong>Compatibility:</strong> Windows, macOS, Linux</li><li><strong>Dimensions:</strong> 120mm x 60mm x 38mm</li><li><strong>Warranty:</strong> 2 years limited warranty</li></ul>"
  },
  {
    "id": "14",
    "slug": "noise-cancelling-microphone",
    "name": "Noise Cancelling Microphone",
    "description": "Capture your voice with professional-grade clarity and eliminate background distractions with the Noise Cancelling Microphone. Featuring a high-quality condenser capsule and a cardioid pickup pattern, this microphone is ideal for streaming, podcasting, voiceovers, and online calls. It’s equipped with an advanced DSP-based noise reduction algorithm that intelligently filters out unwanted ambient noise, ensuring your voice is the only thing heard. The microphone connects via USB-C, making setup incredibly simple—just plug and play. It also includes a built-in headphone jack for real-time monitoring of your audio, allowing you to hear exactly what your audience hears. A dedicated gain dial and a quick-mute button with an LED indicator give you full control over your sound. The included adjustable desktop stand and built-in pop filter help you achieve the perfect setup and sound quality right out of the box. Whether you're a content creator or a professional working from home, this microphone delivers pristine audio for every application.",
    "price": 129.99,
    "originalPrice": 149.99,
    "imageUrl": ["/Product2.jpg", "/product1.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.7,
    "reviewCount": 143,
    "isNew": false,
    "isSale": true,
    "tags": ["Microphone", "Streaming", "Noise Cancelling", "Podcasting", "USB"],
    "specification": "<ul><li><strong>Type:</strong> Condenser microphone with a cardioid polar pattern</li><li><strong>Frequency Response:</strong> 20Hz-20kHz</li><li><strong>Sampling Rate:</strong> 48kHz at 24-bit resolution</li><li><strong>Connectivity:</strong> USB-C plug-and-play</li><li><strong>Features:</strong> DSP-based noise cancellation, real-time headphone monitoring, adjustable gain dial, one-touch mute button with LED indicator</li><li><strong>Max SPL:</strong> 120 dB</li><li><strong>Stand:</strong> Adjustable desktop stand included</li><li><strong>Compatibility:</strong> Windows, macOS, PlayStation 5, and more</li><li><strong>Materials:</strong> Durable metal body with built-in pop filter</li><li><strong>Cable:</strong> 2-meter USB-C to USB-A cable included</li><li><strong>Warranty:</strong> 1 year limited warranty</li></ul>"
  },
  {
    "id": "15",
    "slug": "smart-home-speaker",
    "name": "Smart Home Speaker",
    "description": "Transform your home into a smart, connected space with the Smart Home Speaker. This compact and stylish speaker delivers rich, 360-degree sound that fills any room. With built-in support for multiple voice assistants, you can control your music, get weather updates, manage your calendar, and control other smart devices in your home with simple voice commands. The far-field microphone array accurately picks up your voice from across the room, even with music playing. You can create a multi-room audio system by pairing multiple speakers throughout your home for a synchronized listening experience. A physical microphone mute switch ensures your privacy when you need it. The speaker's design, featuring a recycled plastic housing and a sleek fabric finish, blends seamlessly into any decor. Whether you're setting a timer, playing a podcast, or controlling your lights, this speaker is the central hub for your smart home.",
    "price": 99.99,
    "originalPrice": 129.99,
    "imageUrl": ["/380.jpg", "/Product1.jpg", "/product2.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.4,
    "reviewCount": 500,
    "isNew": false,
    "isSale": true,
    "tags": ["Smart Home", "Speaker", "Voice Assistant", "Audio", "Wireless"],
    "specification": "<ul><li><strong>Voice Assistant:</strong> Compatible with Google Assistant and Amazon Alexa</li><li><strong>Connectivity:</strong> Wi-Fi 802.11ac (2.4GHz/5GHz), Bluetooth 5.0</li><li><strong>Audio:</strong> 360-degree omnidirectional sound with a custom 2.5-inch full-range driver</li><li><strong>Microphone System:</strong> Far-field microphone array for accurate voice recognition, with a physical privacy switch</li><li><strong>Features:</strong> Multi-room audio support, smart home device control, streaming service integration (Spotify, Apple Music, etc.)</li><li><strong>Power:</strong> Requires AC power adapter (included)</li><li><strong>Dimensions:</strong> 5.5\" x 3.5\" x 3.5\" (14 x 9 x 9 cm)</li><li><strong>Weight:</strong> 0.8 lbs (360g)</li><li><strong>Materials:</strong> Housing made from 50% recycled plastic, with a premium fabric cover</li><li><strong>Warranty:</strong> 1-year limited warranty</li></ul>"
  },
  {
    "id": "16",
    "slug": "wooden-dining-table",
    "name": "Wooden Dining Table",
    "description": "Crafted from 100% solid oak wood, this Wooden Dining Table is a statement piece that combines rustic charm with modern elegance. The natural oil finish enhances the wood's beautiful grain patterns and protects it from daily wear, ensuring it will age gracefully and last for generations. Measuring 72 inches in length, it comfortably seats 6-8 people, making it perfect for family dinners and entertaining guests. The sturdy construction, featuring reinforced corners and traditional joinery, guarantees stability and durability. The simple yet sophisticated design seamlessly integrates into a variety of decor styles, from mid-century modern to farmhouse. Assembly is quick and easy, with only the legs needing to be attached. This dining table is not just a piece of furniture; it's the centerpiece of your home, where memories are made and stories are shared.",
    "price": 499.99,
    "originalPrice": 599.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Home & Kitchen",
    "rating": 4.9,
    "reviewCount": 77,
    "isNew": true,
    "isSale": true,
    "tags": ["Wood", "Dining", "Furniture", "Oak", "Solid Wood"],
    "specification": "<ul><li><strong>Material:</strong> 100% solid oak wood from sustainably managed forests</li><li><strong>Finish:</strong> Natural oil finish, non-toxic and eco-friendly</li><li><strong>Dimensions:</strong> 72\" L x 36\" W x 30\" H (183cm x 91cm x 76cm)</li><li><strong>Seating Capacity:</strong> Comfortably seats 6-8 people</li><li><strong>Assembly:</strong> Minimal assembly required (legs attach with included hardware)</li><li><strong>Care:</strong> Wipe with a dry cloth, use wood cleaner and conditioner as needed</li><li><strong>Construction:</strong> Solid wood top with reinforced apron and sturdy legs</li><li><strong>Weight:</strong> 85 lbs (38.5 kg)</li><li><strong>Style:</strong> Contemporary with a rustic touch</li><li><strong>Warranty:</strong> 5-year structural warranty</li></ul>"
  },
  {
    "id": "17",
    "slug": "wireless-charging-pad",
    "name": "Wireless Charging Pad",
    "description": "Say goodbye to tangled cables with our sleek and efficient Wireless Charging Pad. This Qi-certified pad delivers fast, reliable wireless charging to all your compatible devices, including smartphones, earbuds, and smartwatches. With a maximum output of 15W, it provides a faster charge than standard wireless chargers. The pad features foreign object detection and over-voltage protection to ensure safe charging for your devices. A subtle LED indicator confirms when your device is charging correctly. Its compact and lightweight design, featuring a premium aluminum alloy base and a soft-touch top, makes it a stylish addition to any nightstand, desk, or countertop. The included USB-C cable ensures you can start charging right away. Simply place your Qi-enabled device on the pad and watch it power up effortlessly.",
    "price": 39.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.2,
    "reviewCount": 210,
    "isNew": false,
    "isSale": false,
    "tags": ["Wireless", "Charging", "Portable", "Qi", "Accessory"],
    "specification": "<ul><li><strong>Charging Standard:</strong> Qi-certified wireless charging</li><li><strong>Output Power:</strong> 15W, 10W, 7.5W, 5W (auto-adapting)</li><li><strong>Input:</strong> 5V/2A, 9V/1.67A (requires QC 3.0 or PD adapter, not included)</li><li><strong>Compatibility:</strong> All Qi-enabled smartphones (iPhone 8+, Samsung S6+, etc.), AirPods Pro/3, and other wireless charging devices</li><li><strong>Features:</strong> Foreign object detection (FOD), over-voltage and over-current protection</li><li><strong>LED Indicator:</strong> Blue LED for charging, flashes for errors</li><li><strong>Dimensions:</strong> 3.9\" diameter x 0.4\" height (10cm x 1cm)</li><li><strong>Weight:</strong> 70g (2.5 oz)</li><li><strong>Materials:</strong> Aluminum alloy base with a soft-touch top pad</li><li><strong>Cable:</strong> 3ft (1m) USB-C to USB-A cable included</li><li><strong>Warranty:</strong> 1-year limited warranty</li></ul>"
  },
  {
    "id": "18",
    "slug": "hard-shell-travel-suitcase",
    "name": "Hard Shell Travel Suitcase",
    "description": "Travel with confidence and style with our Hard Shell Travel Suitcase. Constructed from a lightweight and durable 100% polycarbonate shell, this suitcase is designed to withstand the rigors of travel and protect your belongings. The integrated TSA-approved combination lock provides added security for your valuables while allowing airport security to inspect your bag without damage. Its four 360-degree spinner wheels glide effortlessly across any surface, and the telescoping aluminum handle adjusts to multiple heights for comfortable maneuvering. The thoughtfully designed interior features a compression system and mesh dividers to keep your clothes and essentials organized and secure. This carry-on size is perfect for short trips and weekend getaways. With a sleek design and a range of colors, this suitcase is a reliable and elegant travel companion.",
    "price": 229.99,
    "originalPrice": 279.99,
    "imageUrl": ["/Product2.jpg", "/product1.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Accessories",
    "rating": 4.7,
    "reviewCount": 134,
    "isNew": true,
    "isSale": true,
    "tags": ["Travel", "Suitcase", "Durable", "Luggage", "Hard Shell"],
    "specification": "<ul><li><strong>Material:</strong> 100% polycarbonate shell</li><li><strong>Dimensions:</strong> 22\" H x 14\" W x 9\" D (56cm x 35.5cm x 23cm) - carry-on compliant for most airlines</li><li><strong>Weight:</strong> 6.8 lbs (3.1 kg)</li><li><strong>Capacity:</strong> 40 liters</li><li><strong>Lock:</strong> Integrated TSA-approved combination lock</li><li><strong>Wheels:</strong> Four silent 360-degree multi-directional spinner wheels</li><li><strong>Handle:</strong> Multi-stage telescoping aluminum handle with push-button lock</li><li><strong>Interior:</strong> Fully lined interior with compression straps and zippered mesh divider</li><li><strong>Colors:</strong> Midnight Black, Silver, Forest Green, Navy Blue</li><li><strong>Warranty:</strong> 10-year limited warranty covering manufacturing defects</li></ul>"
  },
  {
    "id": "19",
    "slug": "professional-dslr-camera",
    "name": "Professional DSLR Camera",
    "description": "Unleash your creativity and capture breathtaking moments with the Professional DSLR Camera. Featuring a powerful 24.2MP APS-C CMOS sensor and a DIGIC 8 image processor, this camera delivers stunning image quality with exceptional detail and vibrant colors, even in low-light conditions. The fast 45-point all cross-type autofocus system ensures you can lock onto your subject with speed and precision. Shoot cinematic video in 4K UHD at 30p and get creative with high-speed video options. The vari-angle touchscreen LCD provides flexibility for shooting from different angles and allows for intuitive menu navigation. With built-in Wi-Fi and Bluetooth, you can easily transfer photos to your smartphone for sharing. The camera comes with a versatile 18-55mm IS STM lens, making it a perfect all-in-one kit for both beginners and seasoned photographers looking to expand their capabilities.",
    "price": 899.99,
    "originalPrice": 1099.99,
    "imageUrl": ["/380.jpg", "/Product1.jpg", "/product2.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.8,
    "reviewCount": 312,
    "isNew": false,
    "isSale": true,
    "tags": ["Camera", "DSLR", "Photography", "Video", "Professional"],
    "specification": "<ul><li><strong>Sensor:</strong> 24.2MP APS-C CMOS sensor</li><li><strong>Image Processor:</strong> DIGIC 8</li><li><strong>Video:</strong> 4K UHD video recording at 30p, Full HD at 60p, 720p at 120p</li><li><strong>Autofocus:</strong> 45-point all cross-type AF system</li><li><strong>ISO Range:</strong> 100-25600 (expandable to 51200)</li><li><strong>Continuous Shooting:</strong> Up to 5 frames per second</li><li><strong>Connectivity:</strong> Wi-Fi, Bluetooth, USB 2.0, HDMI mini</li><li><strong>Display:</strong> 3.0\" Vari-angle touchscreen LCD with 1.04 million dots</li><li><strong>Lens Mount:</strong> EF/EF-S mount</li><li><strong>Kit Includes:</strong> EF-S 18-55mm f/4-5.6 IS STM lens</li><li><strong>Storage:</strong> SD/SDHC/SDXC card slot</li><li><strong>Weight:</strong> 515g (18.2 oz) body only</li><li><strong>Warranty:</strong> 1 year manufacturer warranty</li></ul>"
  },
  {
    "id": "20",
    "slug": "ergonomic-office-chair",
    "name": "Ergonomic Office Chair",
    "description": "Upgrade your workspace with the Ergonomic Office Chair, meticulously designed to provide superior comfort and support for long workdays. This chair features multiple adjustable components, including adjustable lumbar support, armrests, and seat height, allowing you to customize your seating position for optimal posture. The high-density foam seat provides plush cushioning, while the breathable mesh back promotes airflow to keep you cool. The chair can recline from 90 to 135 degrees with a lockable tilt function, perfect for taking a quick break or finding the most comfortable angle. A heavy-duty reinforced nylon base and smooth-rolling casters provide stability and easy mobility. The chair has a weight capacity of up to 300 lbs and is easy to assemble with all tools and instructions included. Say goodbye to back pain and hello to productivity with this modern and supportive office chair.",
    "price": 259.99,
    "originalPrice": 329.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Home & Kitchen",
    "rating": 4.6,
    "reviewCount": 420,
    "isNew": true,
    "isSale": true,
    "tags": ["Office", "Chair", "Ergonomic", "Comfort", "Furniture"],
    "specification": "<ul><li><strong>Material:</strong> High-density molded foam seat, breathable mesh backrest, reinforced nylon base</li><li><strong>Adjustability:</strong> Adjustable lumbar support, 2D adjustable armrests (height and pivot), seat height (4\" range), tilt tension control</li><li><strong>Recline:</strong> 90 to 135-degree recline with tilt lock</li><li><strong>Weight Capacity:</strong> Up to 300 lbs (136 kg)</li><li><strong>Wheels:</strong> 360-degree swivel, smooth-rolling casters suitable for various floor types</li><li><strong>Assembly:</strong> Quick and easy assembly with included tools and step-by-step manual</li><li><strong>Dimensions:</strong> 26\" W x 24\" D x 45-49\" H (adjustable)</li><li><strong>Seat Dimensions:</strong> 20\" W x 19\" D</li><li><strong>Warranty:</strong> 2-year manufacturer warranty on parts and components</li></ul>"
  },
  {
    "id": "21",
    "slug": "non-slip-yoga-mat",
    "name": "Non-Slip Yoga Mat",
    "description": "Find your balance and stability with our Non-Slip Yoga Mat, designed to enhance your practice and support your well-being. This mat is made from eco-friendly TPE (Thermoplastic Elastomer), a non-toxic, PVC-free, and recyclable material. Its 6mm thickness provides extra cushioning and support for your joints, making it comfortable for all poses, from standing to inversions. The double-sided non-slip texture ensures a secure grip on both your hands and feet, preventing slips and slides even during sweaty sessions. The closed-cell surface prevents moisture absorption, making it hygienic and easy to clean. Lightweight and durable, this yoga mat is perfect for use at home, in the studio, or outdoors. A convenient carrying strap is included for easy transport. This mat is a simple yet essential tool for anyone dedicated to their yoga, pilates, or general fitness routine.",
    "price": 45.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Sports & Outdoors",
    "rating": 4.7,
    "reviewCount": 85,
    "isNew": true,
    "isSale": false,
    "tags": ["Yoga", "Fitness", "Eco", "Non-Slip", "Exercise"],
    "specification": "<ul><li><strong>Material:</strong> Eco-friendly, non-toxic, and recyclable TPE (Thermoplastic Elastomer)</li><li><strong>Dimensions:</strong> 72\" L x 24\" W (183cm x 61cm)</li><li><strong>Thickness:</strong> 6mm (0.24 inches)</li><li><strong>Surface:</strong> Double-sided anti-slip texture</li><li><strong>Features:</strong> Closed-cell surface for hygiene, lightweight and portable</li><li><strong>Care:</strong> Wipe clean with a damp cloth and mild soap, air dry</li><li><strong>Weight:</strong> 2.2 lbs (1 kg)</li><li><strong>Included Accessories:</strong> Adjustable carrying strap</li><li><strong>Colors:</strong> Multiple vibrant two-tone color options</li><li><strong>Warranty:</strong> 1-year limited warranty on material defects</li></ul>"
  },
  {
    "id": "22",
    "slug": "hepa-air-purifier",
    "name": "HEPA Air Purifier",
    "description": "Breathe cleaner, healthier air with the HEPA Air Purifier, designed to capture microscopic pollutants and allergens in your home. Its advanced 3-in-1 true HEPA filter system effectively removes 99.97% of airborne particles as small as 0.3 microns, including dust, pollen, pet dander, and smoke. The purifier is powerful enough to circulate air in rooms up to 200 sq ft, making it ideal for bedrooms, offices, and living spaces. It operates quietly with a noise level as low as 25 dB in sleep mode, ensuring a peaceful environment. The purifier features three fan speeds, a convenient timer function, and a filter replacement indicator to help you maintain optimal performance. Its compact and modern design fits seamlessly into any room. With this air purifier, you can significantly improve your indoor air quality and reduce allergy symptoms, creating a more comfortable living space for you and your family.",
    "price": 149.99,
    "imageUrl": ["/Product2.jpg", "/product1.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Home & Kitchen",
    "rating": 4.5,
    "reviewCount": 192,
    "isNew": false,
    "isSale": true,
    "tags": ["Air", "Purifier", "HEPA", "Allergen", "Home"],
    "specification": "<ul><li><strong>Filtration:</strong> True HEPA filter with activated carbon and pre-filter</li><li><strong>Coverage Area:</strong> Up to 200 sq ft (18.6 sq m)</li><li><strong>CADR (Clean Air Delivery Rate):</strong> 130 CFM (220 m³/h)</li><li><strong>Noise Level:</strong> 25-50 dB depending on fan speed</li><li><strong>Features:</strong> 3 fan speeds (low, medium, high), 2/4/8-hour timer, sleep mode, filter replacement indicator</li><li><strong>Dimensions:</strong> 8.5\" x 8.5\" x 14.2\" (21.6 x 21.6 x 36 cm)</li><li><strong>Weight:</strong> 7.5 lbs (3.4 kg)</li><li><strong>Power:</strong> 45W, 120V</li><li><strong>Filter Life:</strong> Recommended replacement every 6-8 months</li><li><strong>Warranty:</strong> 1-year manufacturer warranty</li></ul>"
  },
  {
    "id": "23",
    "slug": "racing-style-gaming-chair",
    "name": "Racing Style Gaming Chair",
    "description": "Level up your gaming setup with the Racing Style Gaming Chair, a perfect combination of ergonomic design, comfort, and style. The chair is upholstered in high-quality PU leather and features a high-density foam padding that conforms to your body for superior comfort during extended gaming sessions. With an impressive recline range from 90 to 180 degrees and a retractable footrest, you can easily switch from an upright gaming posture to a fully relaxed position for watching movies or napping. The adjustable headrest and lumbar support pillows provide targeted support to reduce strain on your neck and back. The 3D adjustable armrests can be customized to your preferred height and angle. A heavy-duty nylon base and smooth-rolling casters ensure stability and mobility on any surface. This chair offers the look of a high-performance racing seat with the comfort and features needed for a true gaming marathon.",
    "price": 329.99,
    "originalPrice": 399.99,
    "imageUrl": ["/380.jpg", "/Product1.jpg", "/product2.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.6,
    "reviewCount": 248,
    "isNew": true,
    "isSale": true,
    "tags": ["Gaming", "Chair", "Comfort", "Ergonomic", "Racing"],
    "specification": "<ul><li><strong>Material:</strong> High-quality PU leather, high-density molded foam, steel frame, heavy-duty nylon base</li><li><strong>Recline:</strong> 90° to 180° recline with tilt lock and tension control</li><li><strong>Footrest:</strong> Retractable footrest with reinforced steel brackets</li><li><strong>Pillows:</strong> Adjustable and removable headrest and lumbar support pillows</li><li><strong>Armrests:</strong> 3D adjustable (height, depth, and swivel)</li><li><strong>Weight Capacity:</strong> Up to 350 lbs (158 kg)</li><li><strong>Base:</strong> Heavy-duty 5-star nylon base with smooth-rolling PU casters</li><li><strong>Assembly:</strong> Easy to assemble, with detailed instructions and tools included</li><li><strong>Warranty:</strong> 1-year limited warranty on parts</li><li><strong>Dimensions:</strong> 27\" W x 28\" D x 49-53\" H (adjustable)</li></ul>"
  },
  {
    "id": "24",
    "slug": "high-speed-blender",
    "name": "High-Speed Blender",
    "description": "Blend, crush, and pulverize with our High-Speed Blender, a powerful kitchen tool designed for a variety of tasks, from making silky smooth smoothies to hot soups and savory sauces. The robust 1200W motor and six-leaf stainless steel blades effortlessly break down fruits, vegetables, ice, and nuts in seconds. The large 60 oz (1.8 L) BPA-free pitcher is perfect for family-sized batches. With a variable speed dial and a pulse function, you have complete control over the texture of your blend. The blender also features overload protection to prevent the motor from overheating and a self-cleaning function for easy maintenance. The pitcher is dishwasher safe, making cleanup a breeze. A tamper is included to help with thick, stubborn blends. This high-performance blender is a versatile and indispensable appliance for any health-conscious kitchen.",
    "price": 89.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Home & Kitchen",
    "rating": 4.4,
    "reviewCount": 142,
    "isNew": false,
    "isSale": false,
    "tags": ["Blender", "Kitchen", "Smoothies", "Appliance", "High-Speed"],
    "specification": "<ul><li><strong>Motor:</strong> 1200W high-torque motor</li><li><strong>Blades:</strong> 6-leaf hardened stainless steel blades</li><li><strong>Capacity:</strong> 60 oz (1.8 L) BPA-free Tritan pitcher</li><li><strong>Speed Settings:</strong> Variable speed control dial + pulse function</li><li><strong>Features:</strong> Overload and overheat protection, tamper included</li><li><strong>Dimensions:</strong> 16.5\" H x 7.5\" W x 7.5\" D</li><li><strong>Weight:</strong> 8 lbs (3.6 kg)</li><li><strong>Cleaning:</strong> Self-cleaning function (add water and soap), dishwasher-safe pitcher</li><li><strong>Warranty:</strong> 2-year limited warranty</li></ul>"
  },
  {
    "id": "25",
    "slug": "next-gen-gaming-console",
    "name": "Next-Gen Gaming Console",
    "description": "Dive into the future of gaming with the Next-Gen Gaming Console, a powerful machine that redefines the gaming experience. Powered by a custom 8-core AMD Zen 2 CPU and a 10.28 TFLOPS GPU, it delivers stunning 4K HDR graphics with unprecedented realism. The ultra-fast 825GB custom NVMe SSD provides near-instantaneous loading times, allowing you to jump into games faster than ever before. The console supports gaming at up to 120 frames per second on compatible displays. A 4K UHD Blu-ray drive lets you enjoy movies and games in the highest possible quality. The revolutionary DualSense wireless controller, included in the box, features haptic feedback and adaptive triggers that provide a new level of immersion, letting you feel the action in your hands. Tempest 3D AudioTech creates a rich, spatial soundscape that puts you at the center of the action. This console is the ultimate entertainment hub for serious gamers.",
    "price": 499.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Electronics",
    "rating": 4.9,
    "reviewCount": 654,
    "isNew": true,
    "isSale": false,
    "tags": ["Gaming", "Console", "4K", "Next-Gen", "Entertainment"],
    "specification": "<ul><li><strong>CPU:</strong> AMD Zen 2-based 8 Cores at 3.5GHz (variable frequency)</li><li><strong>GPU:</strong> AMD RDNA 2-based, 10.28 TFLOPS, 36 CUs at 2.23GHz (variable frequency)</li><li><strong>RAM:</strong> 16GB GDDR6</li><li><strong>Storage:</strong> 825GB custom NVMe SSD</li><li><strong>Optical Drive:</strong> 4K UHD Blu-ray drive</li><li><strong>Video Output:</strong> HDMI 2.1, supports 4K at 120Hz and 8K</li><li><strong>Audio:</strong> Tempest 3D AudioTech</li><li><strong>Ports:</strong> USB-C, USB-A, Ethernet, HDMI 2.1</li><li><strong>Controller:</strong> DualSense wireless controller with haptic feedback and adaptive triggers</li><li><strong>Connectivity:</strong> Wi-Fi 6, Bluetooth 5.1</li><li><strong>Warranty:</strong> 1 year manufacturer warranty</li></ul>"
  },
  {
    "id": "26",
    "slug": "insulated-winter-jacket",
    "name": "Insulated Winter Jacket",
    "description": "Stay warm and protected in the harshest winter conditions with our Insulated Winter Jacket. The jacket features a durable, water-resistant outer shell made from 100% recycled nylon, and is insulated with RDS (Responsible Down Standard) certified down for exceptional warmth without the weight. The DWR (Durable Water Repellent) finish sheds light rain and snow, keeping you dry. An adjustable, insulated hood provides extra protection from the elements, while the elastic cuffs with velcro closures seal in warmth. The full-length YKK® Vislon® zipper is robust and smooth. With two zippered hand pockets and an internal zippered pocket, you have plenty of secure storage for your essentials. This jacket's classic, regular fit is designed for comfort and layering, making it a versatile choice for city life and outdoor adventures. Stay cozy and stylish all winter long with this high-performance insulated jacket.",
    "price": 199.99,
    "originalPrice": 249.99,
    "imageUrl": ["/Product2.jpg", "/product1.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Clothing",
    "rating": 4.7,
    "reviewCount": 99,
    "isNew": true,
    "isSale": true,
    "tags": ["Jacket", "Winter", "Insulated", "Down", "Water-Resistant"],
    "specification": "<ul><li><strong>Material:</strong> 100% recycled nylon shell, RDS certified 650-fill-power down insulation</li><li><strong>Water Resistance:</strong> Durable Water Repellent (DWR) finish</li><li><strong>Pockets:</strong> 2 zippered hand pockets, 1 internal zippered chest pocket</li><li><strong>Hood:</strong> Adjustable, insulated hood</li><li><strong>Cuffs:</strong> Elastic cuffs with velcro closure</li><li><strong>Zipper:</strong> Full-length YKK® Vislon® zipper</li><li><strong>Fit:</strong> Regular fit, designed for comfortable layering</li><li><strong>Weight:</strong> 750g (size M)</li><li><strong>Care:</strong> Machine wash cold on a delicate cycle, tumble dry low with tennis balls to restore loft</li><li><strong>Sizes:</strong> S to XXL</li><li><strong>Colors:</strong> Black, Navy, Olive Green</li><li><strong>Warranty:</strong> 1-year limited warranty on manufacturing defects</li></ul>"
  },
  {
    "id": "27",
    "slug": "robot-vacuum-cleaner",
    "name": "Robot Vacuum Cleaner",
    "description": "Keep your floors spotless with the Robot Vacuum Cleaner, a smart and efficient solution for hands-free cleaning. This vacuum features advanced Lidar mapping technology and smart navigation to create a precise map of your home, allowing it to clean in neat, systematic rows without missing a spot. With a powerful 2500Pa of suction, it effortlessly lifts dirt, dust, and pet hair from both hard floors and carpets. Control the vacuum from your smartphone via the companion app, where you can set cleaning schedules, define no-go zones, and monitor the cleaning progress from anywhere. The large 600ml dustbin reduces the frequency of emptying, and its powerful battery provides up to 120 minutes of continuous cleaning. It automatically returns to its charging dock when the battery is low. With obstacle detection and voice control compatibility with smart assistants, this robot vacuum makes cleaning effortless and convenient.",
    "price": 299.99,
    "originalPrice": 349.99,
    "imageUrl": ["/380.jpg", "/Product1.jpg", "/product2.jpg", "/4094.jpg"],
    "category": "Home & Kitchen",
    "rating": 4.6,
    "reviewCount": 288,
    "isNew": false,
    "isSale": true,
    "tags": ["Robot", "Vacuum", "Smart Home", "Cleaning", "Appliance"],
    "specification": "<ul><li><strong>Suction Power:</strong> 2500Pa with multiple power settings</li><li><strong>Navigation:</strong> Lidar mapping and SLAM (Simultaneous Localization and Mapping) technology</li><li><strong>Battery Life:</strong> Up to 120 minutes of cleaning on a single charge</li><li><strong>Dustbin Capacity:</strong> 600ml</li><li><strong>App Control:</strong> Yes, for scheduling, mapping, and zone cleaning</li><li><strong>Features:</strong> Auto-recharge, fall prevention sensors, obstacle detection, voice control compatible with Alexa and Google Assistant</li><li><strong>Dimensions:</strong> 13.7\" diameter x 3.5\" height (35cm x 8.9cm)</li><li><strong>Noise Level:</strong> < 60dB</li><li><strong>Warranty:</strong> 1-year limited warranty</li></ul>"
  },
  {
    "id": "28",
    "slug": "tablet-pro-11",
    "name": "Tablet Pro 11",
    "description": "Experience unparalleled power and portability with the Tablet Pro 11, a device designed for creativity and productivity. The stunning 11-inch Liquid Retina IPS display delivers vibrant colors and sharp details, making it perfect for drawing, editing, and consuming media. Powered by the incredibly fast A14 Bionic chip, this tablet handles demanding apps and games with ease. The dual-camera system, featuring a 12MP wide and 10MP ultra-wide lens, lets you capture professional-quality photos and 4K video. With up to 10 hours of battery life, you can work and play all day without needing to recharge. The USB-C port with Thunderbolt/USB 4 support provides high-speed data transfer and versatile connectivity. The tablet is compatible with a Pro Stylus (sold separately), which allows for pixel-perfect precision for drawing and note-taking. With a sleek design and powerful performance, the Tablet Pro 11 is your portable creative studio and mobile office.",
    "price": 649.99,
    "originalPrice": 699.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Electronics",
    "rating": 4.8,
    "reviewCount": 412,
    "isNew": true,
    "isSale": true,
    "tags": ["Tablet", "Stylus", "Portable", "Productivity", "4K"],
    "specification": "<ul><li><strong>Display:</strong> 11\" Liquid Retina IPS display, 2388 x 1668 resolution, ProMotion technology, True Tone</li><li><strong>Processor:</strong> A14 Bionic chip with Neural Engine</li><li><strong>Storage:</strong> 128GB, 256GB, 512GB, and 1TB options</li><li><strong>Camera:</strong> 12MP Wide camera, 10MP Ultra-Wide camera, LiDAR Scanner</li><li><strong>Video:</strong> 4K video recording at 24/30/60 fps</li><li><strong>Battery:</strong> Up to 10 hours of web surfing or video playback</li><li><strong>Ports:</strong> USB-C port with Thunderbolt/USB 4 support</li><li><strong>Connectivity:</strong> Wi-Fi 6, Bluetooth 5.0, optional 5G cellular</li><li><strong>Stylus Support:</strong> Compatible with Pro Stylus (sold separately)</li><li><strong>OS:</strong> iPadOS</li><li><strong>Dimensions:</strong> 9.74\" x 7.02\" x 0.23\" (247.6 x 178.5 x 5.9 mm)</li><li><strong>Weight:</strong> 1.03 lbs (466g)</li><li><strong>Warranty:</strong> 1 year limited warranty</li></ul>"
  },
  {
    "id": "29",
    "slug": "casual-sneakers",
    "name": "Casual Sneakers",
    "description": "Step out in style and comfort with our Casual Sneakers, the perfect footwear for any occasion. The stylish upper is crafted from a breathable woven mesh with synthetic suede overlays, providing a modern look and feel. The lightweight EVA foam midsole offers superior cushioning and all-day comfort, whether you're walking around town or spending a long day on your feet. The durable rubber outsole with a multidirectional tread provides reliable traction. A soft textile lining and a removable cushioned insole enhance the overall comfort. The classic lace-up design ensures a secure and adjustable fit. Available in a variety of classic colors, these sneakers are easy to pair with jeans, shorts, or casual dresses. They are designed to be true to size and offer a regular width fit, making them a go-to choice for effortless, everyday style.",
    "price": 79.99,
    "imageUrl": ["/Product1.jpg", "/product2.jpg", "/380.jpg", "/4094.jpg"],
    "category": "Footwear",
    "rating": 4.3,
    "reviewCount": 186,
    "isNew": true,
    "isSale": false,
    "tags": ["Sneakers", "Casual", "Comfort", "Lifestyle", "Footwear"],
    "specification": "<ul><li><strong>Upper Material:</strong> Breathable woven mesh with synthetic suede overlays</li><li><strong>Midsole:</strong> Lightweight EVA foam with shock absorption</li><li><strong>Outsole:</strong> Durable, non-marking rubber outsole</li><li><strong>Closure:</strong> Traditional lace-up closure</li><li><strong>Fit:</strong> True to size, regular width</li><li><strong>Lining:</strong> Soft, moisture-wicking textile lining</li><li><strong>Insole:</strong> Removable cushioned insole for added comfort</li><li><strong>Colors:</strong> White, Black, Gray, Navy Blue, Maroon</li><li><strong>Sizes:</strong> US 5-12, including half sizes</li><li><strong>Weight:</strong> 10 oz (283g) per shoe (for US size 9)</li><li><strong>Warranty:</strong> 6-month limited warranty on manufacturing defects</li></ul>"
  },
  {
    "id": "30",
    "slug": "adjustable-dslr-tripod",
    "name": "Adjustable DSLR Tripod",
    "description": "Achieve professional-quality photos and videos with the Adjustable DSLR Tripod. Constructed from a high-grade aluminum alloy, this tripod is both lightweight and durable, making it an ideal companion for photographers on the go. It extends to a maximum height of 65 inches and folds down to a compact 18 inches for easy transport in the included carrying case. The 3-way pan-and-tilt head allows for precise camera positioning and smooth movement for panoramic shots and video. A quick-release plate makes mounting and dismounting your camera fast and simple. The tripod features flip leg locks for quick height adjustments and rubber feet for stable footing on various surfaces. With a load capacity of 8.8 lbs, it is suitable for most DSLR cameras, mirrorless cameras, and camcorders. This tripod is an essential tool for capturing sharp, stable, and creative images, whether you're shooting landscapes, portraits, or long-exposure photography.",
    "price": 119.99,
    "imageUrl": ["/4094.jpg", "/Product1.jpg", "/product2.jpg", "/380.jpg"],
    "category": "Accessories",
    "rating": 4.5,
    "reviewCount": 75,
    "isNew": false,
    "isSale": false,
    "tags": ["Tripod", "Photography", "DSLR", "Video", "Accessories"],
    "specification": "<ul><li><strong>Material:</strong> High-grade aluminum alloy</li><li><strong>Maximum Height:</strong> 65 inches (165 cm)</li><li><strong>Folded Length:</strong> 18 inches (45 cm)</li><li><strong>Weight:</strong> 2.8 lbs (1.3 kg)</li><li><strong>Load Capacity:</strong> 8.8 lbs (4 kg)</li><li><strong>Head Type:</strong> 3-way pan-and-tilt head with bubble level</li><li><strong>Legs:</strong> 4-section legs with quick flip locks</li><li><strong>Features:</strong> Quick-release plate, center column hook for stability, rubber feet</li><li><strong>Included Accessories:</strong> Padded carrying case</li><li><strong>Compatibility:</strong> Universal 1/4\" screw mount for most cameras</li><li><strong>Warranty:</strong> 1-year limited warranty</li></ul>"
  }
]